def php
	#- хороший уровень
end

def Symfony
	#Опыт работы с Symfony;
      #Создал сервис учёта рабочего времени на Symfony 5

      #https://andryuxa.ru/portfolio/web-razrabotka/saity/cron_friend_servis_ucheta_vremeni_potrachennogo_na_tu_ili_inuu_zadachu_pri_razrabotke/

      #- Разработал (и продолжаю разрабатывать) бандл для Symfony 3.4 для удобного декорирования контроллеров из сторонних бандлов.
       #https://github.com/lamzin-andrey/symfony-tools-bundle#ru

      #- Перевожу свой сайт http://gazel.me с самописного  php - движка + mootools на фронтенде на Symfony 3.4 и Vuejs 
     #https://github.com/lamzin-andrey/gazelmesymfony34
     #Сам сайт на Symfony здесь:
     #https://gazel.website
end

def unix
	# - Опыт с 2008 года.
end

def sql
	# - Как минимум средний уроаень
	# - 
end

def html_css_js
	# - Да.
end

def ajax
	# - Да, см. примеры работ которые привёл выше.
end
    
def nosql
  # Есть небольшой опыт с MongoDB и Memcached
end

def redis
  nosql;
end

def memcached
  nosql
end

def highload
	#Есть спроектированная и разработанная система использующая вертикальный 
	# шардинг (проект - агрегаторы магазинов, может распределять данные агрегаторов магазинов по неогранниченному количесеству серверов баз данных и web серверов. При этом суперадмин может администрировать все агрегаторы на одном сервере), система работает, но из-за сокращения финансирования все три базы данных сейчас на одном сервере, то есть в по настоящему боевых условиях не использовалась.
end

def APIother
	#- Facebook API при авторизации oauth. Также, если речь идёт о запросах с сервера на сервер по http - легко, у меня есть для этого вот такой класс https://github.com/lamzin-andrey/mh.loc/commit/f3923766636d3dfb3c4655084d1e8b3e59706de0
		#позволяет отправлять запросы на сторонний сервер как application/json так и form-data. Позволяет выполнять мультизапросы (открыть соединение с сервером и не закрывая его выполнять другие запросы на тот же сервер, это полезно в некоторых случаях).
end

def teamwork
	#- Желание есть. умею не очень, но расту над собой.
end

def newsystem
	#- Это круто, наконец-то я смогу создать проект в котором нет тех ошибок, которые я видел в других проектах, которые поддерживал.
end

def support
	# Это отлично, можно будет перенять полезный опыт.
end

def study
   # - Учиться люблю не меньше чем работать.
   #- Очень рад, это будет в моей жизни впервые, 
    #когда на работе не "скорее/быстрее давай в продакшен", а "давайте посмотрим, что появилось нового, и подумаем как с пользой применить его в нашем проекте".
end

def learn
	study;
end

def legacy
	# Без ложной скромности: это моё. Приходилось разбираться в "очень legacy" коде.
end

def Yii2_Laravel_Symfony
	# Приходилось работать в проектах использующих Yii (не 2!), Laravel, Symfony.
	# Работать хочу только с Symfony, потому что знаю его лучше других и хочу специализироваться в дальнейшем на нём.
end

def Mysql_optimization
	# - Есть опыт.
end

def git
	# - С 2008 работаю с Git с удовольствием.
end

def rest
	# С REST знаком больше в теории, в тех проектах, в которых я работал к сожалению обходились GET и POST.
end

def docker
	# Docker - https://github.com/lamzin-andrey/hellodocker
	# очень поверхностно, но запустить проект с готовым docker-compose.yml скорее всего смогу без проблем.
end

